# ==============================================================================
# Quartus Prime Synopsys Design Constraint File
# Generated by OpenGateware - Gateman CLI v0.1.0
# ==============================================================================
# Analogue Pocket SDC settings
# Users are recommended to modify this file to match users logic.
# Put your clock groups in here as well as any net assignments.
# ==============================================================================

# ==============================================================================
# Time Information
# ==============================================================================

# ==============================================================================
# Create Clock
# ==============================================================================

# ==============================================================================
# Create Generated Clock
# ==============================================================================

# ==============================================================================
# Set Clock Latency
# ==============================================================================

# ==============================================================================
# Set Clock Uncertainty
# ==============================================================================

# ==============================================================================
# Set Input Delay
# ==============================================================================
set_input_delay -clock { ic|core_pll|core_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } -max 6.4 [get_ports dram_dq[*]]
set_input_delay -clock { ic|core_pll|core_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } -min 3.1 [get_ports dram_dq[*]]
# set_input_delay -clock dram_clk -reference_pin [get_ports {dram_clk}] -max 6.4 [get_ports dram_dq[*]]
# set_input_delay -clock dram_clk -reference_pin [get_ports {dram_clk}] -min 3.2 [get_ports dram_dq[*]]

# ==============================================================================
# Set Output Delay
# ==============================================================================
set_output_delay -clock { ic|core_pll|core_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } -min -0.8 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]
set_output_delay -clock { ic|core_pll|core_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } -max 1.5 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]
# tDH, hold time, spec is 0.8ns
# set_output_delay -clock dram_clk -min -0.8 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]
# tDS, setup time, spec is 1.5ns
# set_output_delay -clock dram_clk -max 1.5 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]

# ==============================================================================
# Set Clock Groups
# ==============================================================================

# ==============================================================================
# Set False Path
# ==============================================================================

# ==============================================================================
# Set Multicycle Path
# ==============================================================================
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|regs.*} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|regs.*} -hold 1
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|bus_datawrite[*]} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|bus_datawrite[*]} -hold 1
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|bus_addr[*]} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|v30:v30|bus_addr[*]} -hold 1

set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|regs.*} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|regs.*} -hold 1
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|bus_datawrite[*]} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|bus_datawrite[*]} -hold 1
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|bus_addr[*]} -setup 2
set_multicycle_path -from {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|*} -to {core_top:ic|irem_m92:u_irem_m92_top|m92:m92|sound:sound|v35:v35|v30:core|bus_addr[*]} -hold 1
# ==============================================================================
# Set Maximum Delay
# ==============================================================================

# ==============================================================================
# Set Minimum Delay
# ==============================================================================

# ==============================================================================
# Set Input Transition
# ==============================================================================

