# ==============================================================================
# Quartus Prime Synopsys Design Constraint File
# Generated by OpenGateware - Gateman CLI v0.1.0
# ==============================================================================
# Analogue Pocket SDC settings
#
# Do not edit this file
# Add your own constraints in the sdc in the project directory
# ==============================================================================
#
# DEVICE "5CEBA4F23C8"
#
# ==============================================================================
# Time Information
# ==============================================================================
set_time_format -unit ns -decimal_places 3

# ==============================================================================
# Create Clock
# ==============================================================================
create_clock -name clk_74a -period 13.468 [get_ports clk_74a]
create_clock -name clk_74b -period 13.468 [get_ports clk_74b]
create_clock -name bridge_spiclk -period 13.468 [get_ports bridge_spiclk]

# ==============================================================================
# Create Generated Clock
# ==============================================================================
derive_pll_clocks -create_base_clocks

# ==============================================================================
# Set Clock Latency
# ==============================================================================

# ==============================================================================
# Set Clock Uncertainty
# ==============================================================================
derive_clock_uncertainty

# ==============================================================================
# Set Input Delay
# ==============================================================================

# ==============================================================================
# Set Output Delay
# ==============================================================================
# tDH, hold time, spec is 0.8ns
#set_output_delay -clock dram_clk -min -0.8 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]
# tDS, setup time, spec is 1.5ns
#set_output_delay -clock dram_clk -max 1.5 [get_ports {dram_a[*] dram_ba[*] dram_cke dram_dqm[*] dram_dq[*] dram_ras_n dram_cas_n dram_we_n}]

# ==============================================================================
# Set Clock Groups
# ==============================================================================
set_clock_groups -asynchronous \
 -group { bridge_spiclk } \
 -group { clk_74a } \
 -group { clk_74b } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[1].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[2].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[3].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[4].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|general[5].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[0].output_counter|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[1].output_counter|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[2].output_counter|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[3].output_counter|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[4].output_counter|divclk } \
 -group { ic|core_pll|core_pll_inst|altera_pll_i|cyclonev_pll|counter[5].output_counter|divclk } \
 -group { ic|video_pll|video_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|video_pll|video_pll_inst|altera_pll_i|general[1].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|sdram_pll|sdram_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|sdram_pll|sdram_pll_inst|altera_pll_i|general[1].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|u_pocket_audio_mixer|audio_pll|mf_audio_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|u_pocket_audio_mixer|audio_pll|mf_audio_pll_inst|altera_pll_i|general[1].gpll~PLL_OUTPUT_COUNTER|divclk }

# ==============================================================================
# Set False Path
# ==============================================================================
set_false_path -from [get_ports {bridge_1wire}]
set_false_path -from [get_ports {bridge_spimiso}]
set_false_path -from [get_ports {bridge_spimosi}]
set_false_path -from [get_ports {bridge_spiss}]

set_false_path -to   [get_ports {bridge_1wire}]
set_false_path -to   [get_ports {bridge_spimiso}]
set_false_path -to   [get_ports {bridge_spimosi}]
set_false_path -to   [get_ports {scal_auddac}]
set_false_path -to   [get_ports {scal_audlrck}]
set_false_path -to   [get_ports {scal_audmclk}]
set_false_path -to   [get_ports {scal_clk}]
set_false_path -to   [get_ports {scal_de}]
set_false_path -to   [get_ports {scal_hs}]
set_false_path -to   [get_ports {scal_skip}]
set_false_path -to   [get_ports {scal_vid[*]}]
set_false_path -to   [get_ports {scal_vs}]

# ==============================================================================
# Set Multicycle Path
# ==============================================================================

# ==============================================================================
# Set Maximum Delay
# ==============================================================================

# ==============================================================================
# Set Minimum Delay
# ==============================================================================

# ==============================================================================
# Set Input Transition
# ==============================================================================
